AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>Блок учета продаж товаров и оказания услуг</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество проданного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНормочасов</Name>
					<Comment>Количество нормочасов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьУпр</Name>
					<Comment>Себестоимость упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Comment>Себестоимость регл. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСВходящий</Name>
					<Comment>Сумма входящего НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был зафиксирован факт продажи товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Проданный товар или оказанная услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщик у которого товар был куплен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Покупатель который купил товар или которому была оказана услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар мы продали (собственный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с покупателем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании с которого товар был продан</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Авторабота</Name>
					<Comment>Авторабота</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщикуАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераЗаАвтомобили</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступленияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.АктРазногласий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПартииТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровКомпании</Name>
			<Comment>Блок учета партий товаров компании собственных и принятых на комиссию</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток товара на складе в разрезе партий</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщикуАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераЗаАвтомобили</v8:Type>
						<v8:Type>cfg:DocumentRef.АктРазногласий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия по которой поступил или был взят на комиссию товар</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/Renault_PDI_ОчередьЗаказНарядов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_PDI_ОчередьЗаказНарядов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтправкиВRF</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/Renault_PDI/Ext/Module.bsl
Процедура Renault_PDI_ПриПроведении_ПоступленияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ЭтоPDI = Ложь Тогда
		Возврат;
	КонецЕсли;
			
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИзменениеЦен.Ссылка
	|ИЗ
	|	Документ.ИзменениеЦен КАК ИзменениеЦен
	|ГДЕ
	|	ИзменениеЦен.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ИзмЦенОб = Выборка.Ссылка.ПолучитьОбъект();
		
	Иначе
		
		ИзмЦенОб = Документы.ИзменениеЦен.СоздатьДокумент();
		ИзмЦенОб.ДокументОснование = Источник.Ссылка;
		
	КонецЕсли;
	
	ИзмЦенОб.ЗаполнитьСвойстваНаОсновании(Источник.Ссылка);
	ИзмЦенОб.ОбработкаЗаполнения(Источник.Ссылка);
	ИзмЦенОб.Записать(РежимЗаписиДокумента.Проведение, РежимПроведения);	
	
КонецПроцедуры

Процедура Renault_PDI_РазблокироватьАвтоRF(VIN, Дата) Экспорт
	
	Если Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ЭтоPDI = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросИД = "Select ID_AUTO from [Buddha].[Reservation].[dbo].[rf_auto] where VIN = '%1'";
	ЗапросИД = СтрЗаменить(ЗапросИД, "%1", VIN);
	
	ТаблицаРезультатИД = Renault_ВыполнениеЗапросовReservation.ВыполнитьФункцию(ЗапросИД);
	Если ТаблицаРезультатИД.Количество() = 0 Тогда
		ВызватьИсключение "В RF не найдена машина с VIN " + VIN;
	КонецЕсли;
	
	ИдМашины = ТаблицаРезультатИД[0].ID_AUTO;
	
	ЗапросПроцедура = 
		"exec [Buddha].[Reservation].[dbo].[RF_V3_Auto_AccessoryReady] 'PDI', %1, '%2', ''";
		
	ЗапросПроцедура = СтрЗаменить(ЗапросПроцедура, "%1", Формат(ИдМашины, "ЧРГ=; ЧГ="));
	ЗапросПроцедура = СтрЗаменить(ЗапросПроцедура, "%2", Формат(Дата, "ДФ=yyyyMMdd"));
	
	Renault_ВыполнениеЗапросовReservation.ВыполнитьПроцедуру(ЗапросПроцедура);

КонецПроцедуры

Процедура Renault_PDI_ВыгрузитьЗаказНарядRF(ЗаказНаряд)
	
	Если Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ЭтоPDI = Ложь Тогда
		Возврат;
	КонецЕсли;

	ЗапросИД = "Select ID_AUTO from [Buddha].[Reservation].[dbo].[rf_auto] where VIN = '%1'";
	ЗапросИД = СтрЗаменить(ЗапросИД, "%1", ЗаказНаряд.Автомобиль.VIN);
	
	ТаблицаРезультатИД = Renault_ВыполнениеЗапросовReservation.ВыполнитьФункцию(ЗапросИД);
	Если ТаблицаРезультатИД.Количество() = 0 Тогда
		ВызватьИсключение "В RF не найдена машина с VIN " + ЗаказНаряд.Автомобиль.VIN;
	КонецЕсли;
	
	ИдМашины = ТаблицаРезультатИД[0].ID_AUTO;
	
	ТекстЗапроса = 
		"INSERT INTO [buddha].[RESERVATION].[dbo].[RF_AUTO_ACCESSORIES_DETAILS]
	   		|([ID_AUTO]
	   		|,[VIN]
	   		|,[REFERENCE]
	   		|,[PRICE_LABOUR]
	   		|,[PRICE_PART]
	   		|,[PRICE_PART_ZN]
	   		|,[DATE_BILL]
	   		|,[BILL_NUMBER]
			|,[DATE_ANNULATION]
			|,[CONTRACTOR_NAME]
			|,[CONTRACTOR_INN]
			|,[CONTRACTOR_KPP]
			|,[REQUIRE_BILL_NUMBER]
			|,[REQUIRE_BILL_DATE])
	 	|VALUES
	       |(%1 --<ID_AUTO, bigint,>
	       |,'%2' --<VIN, varchar(20),>
	       |,'%3' --<REFERENCE, varchar(20),>
	       |,%4 --<PRICE_LABOUR, numeric(18,2),>
	       |,%5 --<PRICE_PART, numeric(18,2),>
	       |,%6 --<PRICE_PART_ZN, numeric(18,2),>
	       |,'%7' --<DATE_BILL, date,>
	       |,%8 --<BILL_NUMBER, varchar(100),>
		   |,%9 --DATE_ANNULATION
		   |,#10
		   |,#11
		   |,#12
		   |,#13
		   |,#14)";
	
	Выборка = РегистрыНакопления.Продажи.ВыбратьПоРегистратору(ЗаказНаряд);
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Авторабота) Тогда
			ТекстЗапроса1 = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстЗапроса,
				Формат(ИдМашины, "ЧРД=.; ЧГ="),
				ЗаказНаряд.Автомобиль.VIN,
				Выборка.Авторабота.Артикул,
				Формат(Выборка.Сумма,"ЧРД=.; ЧГ="),
				0,
				0,
				Формат(ЗаказНаряд.ДатаЗакрытия,"ДФ=yyyyMMdd"),
				Формат(ЗаказНаряд.Номер,"ЧРД=.; ЧГ=") ,
				"null");
				
			ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "#10", "'name'");	
			ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "#11", "'inn'");
			ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "#12", "'kpp'");		
			ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "#13", "null");
			ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "#14", "null");
			
		//ИначеЕсли ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
		//	ТекстЗапроса1 = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		//		ТекстЗапроса,
		//		Формат(ИдМашины, "ЧГ="),
		//		ЗаказНаряд.Автомобиль.VIN,
		//		Выборка.Номенклатура.Артикул,
		//		0,
		//		Формат(Выборка.Сумма, "ЧРД=.; ЧГ="),
		//		Формат(Выборка.Себестоимость, "ЧРД=.; ЧГ="),
		//		Формат(ЗаказНаряд.ДатаЗакрытия,"ДФ=yyyyMMdd"),
		//		Формат(ЗаказНаряд.Номер, "ЧРД=.; ЧГ="),
		//		"null");
		//		
		//	ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "#10", "inn");
		//	ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "#11", "kpp");
		//	
		//	Запрос = Новый Запрос;
		//	
		//	ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "#12", "null");
		//	ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "#13", "null");	
				
		КонецЕсли;
		
		Renault_ВыполнениеЗапросовReservation.ВыполнитьПроцедуру(ТекстЗапроса1);
			
	КонецЦикла;
	
	// получим партии
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПартииТоваровКомпании.Номенклатура.Артикул КАК Артикул,
	|	ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПартииТоваровКомпании.Номенклатура,
	|	ПартииТоваровКомпании.Количество,
	|	ПартииТоваровКомпании.Сумма,
	|	ПартииТоваровКомпании.Партия КАК Партия
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ГДЕ
	|	ПартииТоваровКомпании.ДокументПродажи = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ЗаказНаряд);
	ПартииНоменклатуры = Запрос.Выполнить().Выгрузить();	
	
	Для Каждого СтрокаТовары ИЗ ПартииНоменклатуры Цикл
				
		ТекстЗапроса1 = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстЗапроса,
			Формат(ИдМашины, "ЧГ="),
			ЗаказНаряд.Автомобиль.VIN,
			СтрокаТовары.Номенклатура.Артикул,
			0,
			Формат(СтрокаТовары.Сумма, "ЧРД=.; ЧГ="),
			Формат(СтрокаТовары.Сумма, "ЧРД=.; ЧГ="),
			Формат(ЗаказНаряд.ДатаЗакрытия,"ДФ=yyyyMMdd"),
			Формат(ЗаказНаряд.Номер, "ЧРД=.; ЧГ="),
			"null");
			
		ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "#10", "'name'");	
		ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "#11", "'inn'");
		ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "#12", "'kpp'");
		
		Запрос = Новый Запрос;
		
		ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "#13", "'" + СтрокаТовары.Партия.ВхДокНомер + "'");
		ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса1, "#14", "'" + Формат(СтрокаТовары.Партия.ВхДокДата,"ДФ=yyyyMMdd") + "'");
		
		Renault_ВыполнениеЗапросовReservation.ВыполнитьПроцедуру(ТекстЗапроса1);
			
	КонецЦикла;

	
КонецПроцедуры

Процедура Renault_PDI_ПриПроведенииЗаказНарядаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ЭтоPDI = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда	
		РегистрыСведений.Renault_PDI_ОчередьЗаказНарядов.ДобавитьЗапись(Источник.Ссылка);
	Иначе
		РегистрыСведений.Renault_PDI_ОчередьЗаказНарядов.УдалитьЗапись(Источник.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура Renault_PDI_ВыгрузкаЗаказНарядов(Параметр1 = Неопределено) Экспорт
	
	Если Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ЭтоPDI = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ЗаказНаряд = РегистрыСведений.Renault_PDI_ОчередьЗаказНарядов.ПолучитьОчереднуюЗапись();
	Если ЗаказНаряд = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Renault_PDI_РазблокироватьАвтоRF(ЗаказНаряд.Автомобиль.VIN, ЗаказНаряд.ДатаЗакрытия);		
	Renault_PDI_ВыгрузитьЗаказНарядRF(ЗаказНаряд);
	
	РегистрыСведений.Renault_PDI_ОчередьЗаказНарядов.УстановитьДатуОтправки(ЗаказНаряд, ТекущаяДата());
	
КонецПроцедуры

Процедура Renault_PDI_ПриОтменеПроведенияЗаказНарядаОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	Если Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ЭтоPDI = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.Renault_PDI_ОчередьЗаказНарядов.УдалитьЗапись(Источник.Ссылка);
	
	ТекстЗапроса = 
		"Update [buddha].[RESERVATION].[dbo].[RF_AUTO_ACCESSORIES_DETAILS] 
		| set DATE_ANNULATION = '%1'
		| where VIN = '%2' and BILL_NUMBER = '%3'";
		
	ТекстЗапроса = Renault_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ТекстЗапроса, 
		Формат(ТекущаяДата(), "ДФ=yyyyMMdd"),
		Источник.Автомобиль.VIN,
		Источник.Номер);
		
	Renault_ВыполнениеЗапросовReservation.ВыполнитьПроцедуру(ТекстЗапроса);
		
	
КонецПроцедуры
